#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

[command]/home/runner/work/_temp/110d0608-91ad-4bd2-894f-94c7851a0417/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-DGkxZxWXa6mZSpzt

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository.quarkus_qute_server_pages will be updated in-place
  ~ resource "github_repository" "quarkus_qute_server_pages" {
      ~ full_name                   = "quarkiverse/quarkus-qute-server-pages" -> (known after apply)
        id                          = "quarkus-qute-server-pages"
      ~ name                        = "quarkus-qute-server-pages" -> "quarkus-qute-web"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_team.quarkus_qute_server_pages will be updated in-place
  ~ resource "github_team" "quarkus_qute_server_pages" {
      ~ description               = "qute-server-pages team" -> "qute-web team"
        id                        = "7571564"
      ~ name                      = "quarkiverse-qute-server-pages" -> "quarkiverse-qute-web"
      ~ slug                      = "quarkiverse-qute-server-pages" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # github_team_membership.quarkus_hivemq_client["codepitbull"] will be created
  + resource "github_team_membership" "quarkus_hivemq_client" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4651319"
      + username = "codepitbull"
    }

  # github_team_membership.quarkus_univocity_parsers["aruffie"] will be created
  + resource "github_team_membership" "quarkus_univocity_parsers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4707008"
      + username = "aruffie"
    }

  # github_team_repository.quarkus_qute_server_pages must be replaced
-/+ resource "github_team_repository" "quarkus_qute_server_pages" {
      ~ etag       = "W/"c7966f427af6ec3dca9795ad1eb41af15e8577567af42be80e3b5561ba4b8fec"" -> (known after apply)
      ~ id         = "7571564:quarkus-qute-server-pages" -> (known after apply)
      ~ repository = "quarkus-qute-server-pages" -> "quarkus-qute-web" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0
```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*